## Production: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 19 to add, 1 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_query_definition.admin-api-50X-errors will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "admin-api-50X-errors" {
        id                  = "d90d86f4-f54f-4122-88bd-b3893cdb0af4"
        name                = "ADMIN & API - 50X errors"
      ~ query_string        = <<-EOT
          - fields @timestamp, log, kubernetes.labels.app as app, kubernetes.pod_name as pod_name, @logStream
          - | filter kubernetes.labels.app like /admin|api/
          + fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
          + | filter kubernetes.container_name like /admin|api/
            | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_ec2_managed_prefix_list.google_cidrs will be created
  + resource "aws_ec2_managed_prefix_list" "google_cidrs" {
      + address_family = "IPv4"
      + arn            = (known after apply)
      + id             = (known after apply)
      + max_entries    = 100
      + name           = "Google Service CIDRs"
      + owner_id       = (known after apply)
      + tags           = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all       = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + version        = (known after apply)

      + entry {
          + cidr        = (known after apply)
          + description = (known after apply)
        }
    }

  # aws_security_group_rule.blazer-access-dbtools-db will be created
  + resource "aws_security_group_rule" "blazer-access-dbtools-db" {
      + description              = "Access to the Database tool DB"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0285edbc328dde553"
      + self                     = false
      + source_security_group_id = "sg-0eac71b27829f15ef"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.blazer-access-rds-eks will be created
  + resource "aws_security_group_rule" "blazer-access-rds-eks" {
      + description              = "Access to RDS DB through the EKS Security Group"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0285edbc328dde553"
      + self                     = false
      + source_security_group_id = "sg-09e3175f46bc85607"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.blazer-egress-endpoints-gateway will be created
  + resource "aws_security_group_rule" "blazer-egress-endpoints-gateway" {
      + description              = "Security group rule for blazer to S3 gateway"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-0285edbc328dde553"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.blazer-egress-google-cidrs will be created
  + resource "aws_security_group_rule" "blazer-egress-google-cidrs" {
      + description              = "Access Google Services from Blazer"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0285edbc328dde553"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.blazer-egress-private-endpoints will be created
  + resource "aws_security_group_rule" "blazer-egress-private-endpoints" {
      + description              = "Internal egress to VPC PrivateLink endpoints from blazer"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0285edbc328dde553"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.dbtools-db-egress-private-endpoints will be created
  + resource "aws_security_group_rule" "dbtools-db-egress-private-endpoints" {
      + description              = "Internal egress to VPC PrivateLink endpoints from dbtools-db"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0eac71b27829f15ef"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.dbtools-egress-endpoints-gateway will be created
  + resource "aws_security_group_rule" "dbtools-egress-endpoints-gateway" {
      + description              = "Security group rule for dbtools to S3 gateway"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-0eac71b27829f15ef"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.eks-egress-endpoints-gateway will be created
  + resource "aws_security_group_rule" "eks-egress-endpoints-gateway" {
      + description              = "Security group rule for eks securitygroup to S3 gateway"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-09e3175f46bc85607"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.eks-egress-private-endpoints will be created
  + resource "aws_security_group_rule" "eks-egress-private-endpoints" {
      + description              = "Internal egress to VPC PrivateLink endpoints from eks securitygroup"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-09e3175f46bc85607"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.loadbalancer-egress-private-endpoints will be created
  + resource "aws_security_group_rule" "loadbalancer-egress-private-endpoints" {
      + description              = "Internal egress to VPC PrivateLink endpoints from notification loadbalancer"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0bdeffedcd6e50c79"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.notification-worker-egress-endpoints-gateway will be created
  + resource "aws_security_group_rule" "notification-worker-egress-endpoints-gateway" {
      + description              = "Security group rule for notification worker to S3 gateway"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-036cf176cc9de6feb"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.notification-worker-egress-private-endpoints will be created
  + resource "aws_security_group_rule" "notification-worker-egress-private-endpoints" {
      + description              = "Internal egress to VPC PrivateLink endpoints from notification worker"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-036cf176cc9de6feb"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.notify-lb-egress-endpoints-gateway will be created
  + resource "aws_security_group_rule" "notify-lb-egress-endpoints-gateway" {
      + description              = "Security group rule for notification loadbalancer to S3 gateway"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-0bdeffedcd6e50c79"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.private-endpoints-ingress-blazer will be created
  + resource "aws_security_group_rule" "private-endpoints-ingress-blazer" {
      + description              = "VPC PrivateLink endpoints ingress from blazer"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + self                     = false
      + source_security_group_id = "sg-0285edbc328dde553"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.private-endpoints-ingress-dbtools-db will be created
  + resource "aws_security_group_rule" "private-endpoints-ingress-dbtools-db" {
      + description              = "VPC PrivateLink endpoints ingress from dbtools-db"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + self                     = false
      + source_security_group_id = "sg-0eac71b27829f15ef"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.private-endpoints-ingress-eks will be created
  + resource "aws_security_group_rule" "private-endpoints-ingress-eks" {
      + description              = "VPC PrivateLink endpoints ingress from eks securitygroup"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + self                     = false
      + source_security_group_id = "sg-09e3175f46bc85607"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.private-endpoints-ingress-loadbalancer will be created
  + resource "aws_security_group_rule" "private-endpoints-ingress-loadbalancer" {
      + description              = "VPC PrivateLink endpoints ingress from notification loadbalancer"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + self                     = false
      + source_security_group_id = "sg-0bdeffedcd6e50c79"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.private-endpoints-ingress-notification-worker will be created
  + resource "aws_security_group_rule" "private-endpoints-ingress-notification-worker" {
      + description              = "VPC PrivateLink endpoints ingress from notification worker"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + self                     = false
      + source_security_group_id = "sg-036cf176cc9de6feb"
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 19 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + google_cidr_prefix_list_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos-detected-load-balancer-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
